
   [
        {
        "title": "BooknRead",
        "url": "https://booknread.vercel.app/",
        "image": "https://res.cloudinary.com/dx3a3l6k0/image/upload/v1632778817/Screen_Shot_2021-09-27_at_5.37.55_PM_epjm8z.png",
        "description": "This website is my pride and joy, for two reasons. First being that I was able to check out how modals worked and it has been my favorite thing to add to website since. Second, I really love books. It was also a great learning experience in using contenful for my books and then populating them.",
        "github": "https://github.com/redpumpkin21/Project-2"
    },
    {
        "title": "Frizzy",
        "url": "https://confident-shannon-bd54f9.netlify.app/",
        "image": "https://res.cloudinary.com/dx3a3l6k0/image/upload/v1632779116/Screen_Shot_2021-09-27_at_5.44.27_PM_cnvup1.png",
        "description": "This was a group project, in which my main job was the front end. I pulled the information from the backend and populated inside of a page of page. this was really challenging in that I had to make sure that the state and props had to go where they needed to go. One small error messes it all up, but it was so rewarding when I got everything to their desired pages",
        "github": "https://github.com/DeMe0/project3-frontend"
    },
    {
        "title": "K-Drama Love",
        "url": "https://k-drama-love.vercel.app/",
        "image": "https://res.cloudinary.com/dx3a3l6k0/image/upload/v1632780633/Screen_Shot_2021-09-27_at_6.09.45_PM_rmasxb.png",
        "description": "This project, I wanted to get my hands at Angular, so this project was the first one I did with Angular in the front end. I worked with a partner, they did the back end and and I did the front end. The hardes part was being able to show the actors and their names correctly, but I was able to solve this from research. Instead of *ngFor('shows of kdsrv.shows') I had to use *ngFor('actors of shows.actors'). Click the image to check it out!",
        "github": "https://github.com/CodingStephy/K-drama-Love-Frontend-"
    },
    {
        "title": "VideoGame",
        "url": "https://videogames-kohl.vercel.app/",
        "image":"https://res.cloudinary.com/dx3a3l6k0/image/upload/v1643240877/Screen_Shot_2022-01-26_at_6.44.44_PM_slslke.png",
        "description": "This site I wanted to focus on python/django for my back end creating new entries and using React Router 6 along with React Player and a search bar. It was interesting to learn the new ways React Router does thing and that was part of my biggest challenge but I learned pretty quickly.",
        "github": "https://github.com/redpumpkin21/vgfront"
    }
]
